app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
    def index
      print params
      @all_ratings = Movie.ratings
      @movies = Movie.all
      @title_sorted = false
      @release_date_sorted = false
      if params.has_key?(:col)
        session[:col] = params[:col]
      end

      if session[:col] == "title"
        @title_sorted = true
      elsif session[:col] == "release_date"
        @release_date_sorted = true
      end

      @rating_selection = Hash.new
      if params.has_key?(:commit) and params[:commit] = "Refresh"
        if params.has_key?(:ratings)
          session.delete(:ratings)
          session[:ratings] = params[:ratings]
          @movies = Movie.select_by_ratings(params[:ratings].keys)